package telran.homework.algorithms;

public class HW9 {
    /*
    Для каждого предмета вычислим ценность как отношение стоимости к весу:
Предмет 1: Ценность = 10 / 2 = 5
Предмет 2: Ценность = 15 / 3 = 5
Предмет 3: Ценность = 25 / 5 = 5
Предмет 4: Ценность = 35 / 7 = 5
Отсортируем предметы по убыванию их ценности.
В данном случае все предметы имеют одинаковую ценность, так что порядок может быть любым.
Начнем добавлять предметы в рюкзак, учитывая вместимость в 10 кг:
Возьмем Предмет 1 (вес 2 кг, стоимость 10 $).
Возьмем Предмет 2 (вес 3 кг, стоимость 15 $).
Возьмем Предмет 3 (вес 5 кг, стоимость 25 $).
     */
}
